/*************************************************************************
	> File Name: 441.c
	> Author: LiChun
	> Mail: 318082789@qq.com
	> Created Time: 2019年08月12日 星期一 15时42分59秒
 ************************************************************************/

#include <stdio.h>

int main() {
    int x, n, g = 0, a = 2;;
    scanf("%d %d", &x, &n);
    for (int i = x; i < n + x; i++) {
        if (i % 7 != 6 && i % 7 != 0) {
            g += 2;
        }
    } 
    printf("%d\n", g);
    return 0;
}
