/*************************************************************************
	> File Name: 489_偶数个数.cpp
	> Author: LiChun
	> Mail: 318082789@qq.com
	> Created Time: 2019年10月22日 星期二 19时15分21秒
 ************************************************************************/

#include<iostream>
using namespace std;

int main() {
    int m, n;
    cin >> n;
    m = 0;
    while(n--) m = m * 10 + 9;

    return 0;
}

/*
 * f(i, 0/1)
 * f(i, 0) i位数有偶数个3
 * f(i，1) i位数有奇数个3
 * f(i, 1) = f(i - 1, 0) * 9 + f(i - 1, 1)
 * f(i, 1) = f(i - 1, 0) + f(i - 1, 1) * 9
 */
